HloModule jit_train_step, is_scheduled=true, input_output_alias={ {0}: (0, {}, may-alias), {1}: (1, {}, may-alias), {2}: (2, {}, may-alias), {3}: (3, {}, may-alias), {4}: (4, {}, may-alias), {5}: (5, {}, may-alias), {6}: (6, {}, may-alias), {7}: (7, {}, may-alias), {8}: (8, {}, may-alias), {9}: (9, {}, may-alias), {10}: (10, {}, may-alias), {11}: (11, {}, may-alias), {12}: (12, {}, may-alias), {13}: (13, {}, may-alias), {14}: (14, {}, may-alias), {15}: (15, {}, may-alias), {16}: (16, {}, may-alias), {17}: (17, {}, may-alias), {18}: (18, {}, may-alias), {19}: (19, {}, may-alias), {20}: (20, {}, may-alias), {21}: (21, {}, may-alias), {22}: (22, {}, may-alias), {23}: (23, {}, may-alias), {24}: (24, {}, may-alias), {25}: (25, {}, may-alias), {26}: (26, {}, may-alias), {27}: (27, {}, may-alias), {28}: (28, {}, may-alias), {29}: (29, {}, may-alias), {30}: (30, {}, may-alias), {31}: (31, {}, may-alias), {32}: (32, {}, may-alias), {33}: (33, {}, may-alias), {34}: (34, {}, may-alias), {35}: (35, {}, may-alias), {36}: (36, {}, may-alias), {37}: (37, {}, may-alias), {38}: (38, {}, may-alias), {39}: (39, {}, may-alias), {40}: (40, {}, may-alias), {41}: (41, {}, may-alias), {42}: (42, {}, may-alias), {43}: (43, {}, may-alias), {44}: (44, {}, may-alias), {45}: (45, {}, may-alias), {46}: (46, {}, may-alias), {47}: (47, {}, may-alias), {48}: (48, {}, may-alias), {49}: (49, {}, may-alias), {50}: (50, {}, may-alias), {51}: (51, {}, may-alias), {52}: (52, {}, may-alias), {53}: (53, {}, may-alias), {54}: (54, {}, may-alias), {55}: (55, {}, may-alias), {56}: (56, {}, may-alias), {57}: (57, {}, may-alias), {58}: (58, {}, may-alias), {59}: (59, {}, may-alias), {60}: (60, {}, may-alias), {61}: (61, {}, may-alias), {62}: (62, {}, may-alias), {63}: (63, {}, may-alias), {64}: (64, {}, may-alias), {65}: (65, {}, may-alias), {66}: (66, {}, may-alias), {67}: (67, {}, may-alias), {68}: (68, {}, may-alias), {69}: (69, {}, may-alias), {70}: (70, {}, may-alias), {71}: (71, {}, may-alias) }, entry_computation_layout={(s32[], bf16[6144]{0}, bf16[768,32768]{1,0}, bf16[2,1,768,8]{3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, /*index=5*/bf16[2,1,1,6144,16384]{4,3,2,1,0}, bf16[2,1,1,16384,6144]{4,3,2,1,0}, bf16[2,1,6144]{2,1,0}, bf16[2,1,6144]{2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, /*index=10*/bf16[2,1,48,128,768]{4,3,2,1,0}, bf16[2,1,768,48,128]{4,3,2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, bf16[2,1,768,8]{3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, /*index=15*/bf16[2,1,1,6144,16384]{4,3,2,1,0}, bf16[2,1,1,16384,6144]{4,3,2,1,0}, bf16[2,1,6144]{2,1,0}, bf16[2,1,6144]{2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, /*index=20*/bf16[2,1,48,128,768]{4,3,2,1,0}, bf16[2,1,768,48,128]{4,3,2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, bf16[32768,768]{1,0}, s32[], /*index=25*/bf16[6144]{0}, bf16[768,32768]{1,0}, bf16[2,1,768,8]{3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, /*index=30*/bf16[2,1,1,16384,6144]{4,3,2,1,0}, bf16[2,1,6144]{2,1,0}, bf16[2,1,6144]{2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, bf16[2,1,48,128,768]{4,3,2,1,0}, /*index=35*/bf16[2,1,768,48,128]{4,3,2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, bf16[2,1,768,8]{3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, /*index=40*/bf16[2,1,1,16384,6144]{4,3,2,1,0}, bf16[2,1,6144]{2,1,0}, bf16[2,1,6144]{2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, bf16[2,1,48,128,768]{4,3,2,1,0}, /*index=45*/bf16[2,1,768,48,128]{4,3,2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, bf16[32768,768]{1,0}, bf16[6144]{0}, bf16[768,32768]{1,0}, /*index=50*/bf16[2,1,768,8]{3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, bf16[2,1,1,16384,6144]{4,3,2,1,0}, bf16[2,1,6144]{2,1,0}, /*index=55*/bf16[2,1,6144]{2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, bf16[2,1,48,128,768]{4,3,2,1,0}, bf16[2,1,768,48,128]{4,3,2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, /*index=60*/bf16[2,1,768,8]{3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, bf16[2,1,1,16384,6144]{4,3,2,1,0}, bf16[2,1,6144]{2,1,0}, /*index=65*/bf16[2,1,6144]{2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, bf16[2,1,48,128,768]{4,3,2,1,0}, bf16[2,1,768,48,128]{4,3,2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, /*index=70*/bf16[32768,768]{1,0}, s32[], s32[8,8192]{1,0}, s32[8,8192]{1,0}, s32[8,8192]{1,0}, /*index=75*/s32[8,8192]{1,0})->(s32[], bf16[6144]{0}, bf16[768,32768]{1,0}, bf16[2,1,768,8]{3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, /*index=5*/bf16[2,1,1,6144,16384]{4,3,2,1,0}, bf16[2,1,1,16384,6144]{4,3,2,1,0}, bf16[2,1,6144]{2,1,0}, bf16[2,1,6144]{2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, /*index=10*/bf16[2,1,48,128,768]{4,3,2,1,0}, bf16[2,1,768,48,128]{4,3,2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, bf16[2,1,768,8]{3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, /*index=15*/bf16[2,1,1,6144,16384]{4,3,2,1,0}, bf16[2,1,1,16384,6144]{4,3,2,1,0}, bf16[2,1,6144]{2,1,0}, bf16[2,1,6144]{2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, /*index=20*/bf16[2,1,48,128,768]{4,3,2,1,0}, bf16[2,1,768,48,128]{4,3,2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, bf16[32768,768]{1,0}, s32[], /*index=25*/bf16[6144]{0}, bf16[768,32768]{1,0}, bf16[2,1,768,8]{3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, /*index=30*/bf16[2,1,1,16384,6144]{4,3,2,1,0}, bf16[2,1,6144]{2,1,0}, bf16[2,1,6144]{2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, bf16[2,1,48,128,768]{4,3,2,1,0}, /*index=35*/bf16[2,1,768,48,128]{4,3,2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, bf16[2,1,768,8]{3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, /*index=40*/bf16[2,1,1,16384,6144]{4,3,2,1,0}, bf16[2,1,6144]{2,1,0}, bf16[2,1,6144]{2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, bf16[2,1,48,128,768]{4,3,2,1,0}, /*index=45*/bf16[2,1,768,48,128]{4,3,2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, bf16[32768,768]{1,0}, bf16[6144]{0}, bf16[768,32768]{1,0}, /*index=50*/bf16[2,1,768,8]{3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, bf16[2,1,1,16384,6144]{4,3,2,1,0}, bf16[2,1,6144]{2,1,0}, /*index=55*/bf16[2,1,6144]{2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, bf16[2,1,48,128,768]{4,3,2,1,0}, bf16[2,1,768,48,128]{4,3,2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, /*index=60*/bf16[2,1,768,8]{3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, bf16[2,1,1,6144,16384]{4,3,2,1,0}, bf16[2,1,1,16384,6144]{4,3,2,1,0}, bf16[2,1,6144]{2,1,0}, /*index=65*/bf16[2,1,6144]{2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, bf16[2,1,48,128,768]{4,3,2,1,0}, bf16[2,1,768,48,128]{4,3,2,1,0}, bf16[2,1,768,8,128]{4,3,2,1,0}, /*index=70*/bf16[32768,768]{1,0}, s32[], bf16[], f32[], f32[], /*index=75*/f32[], bf16[], bf16[], s32[])}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false}, allow_spmd_sharding_propagation_to_output={false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,true,true,true,true,true,true,true}, num_partitions=32, frontend_attributes={fingerprint_before_lhs="02b20ea3b1eb04a913291971bfe39182"}

%compare-greater-than.6.clone.clone.clone.clone.clone.clone.clone.clone.clone.2 (p.0.lhs.34: f32[], p.0.rhs.34: f32[], p.1.lhs.34: s32[], p.1.rhs.34: s32[]) -> pred[] {
  %constant_5508_0 = s32[] constant(2147483647)
  %constant_5507_0 = s32[] constant(0)
  %p.1.rhs.34 = s32[] parameter(3), metadata={scheduling_name="p.1.rhs.34"}
  %p.1.lhs.34 = s32[] parameter(2), metadata={scheduling_name="p.1.lhs.34"}
  %p.0.rhs.34 = f32[] parameter(1), metadata={scheduling_name="p.0.rhs.34"}
  %p.0.lhs.34 = f32[] parameter(0), metadata={scheduling_name="p.0.lhs.34"}
  %compare.1662.0 = pred[] compare(%p.1.lhs.34, %p.1.rhs.34), direction=LT, metadata={scheduling_name="compare.1662.0"}
  %bitcast-convert.73.0 = s32[] bitcast-convert(%p.0.rhs.34), metadata={scheduling_name="bitcast-convert.73.0"}
  %compare.1658.0 = pred[] compare(%bitcast-convert.73.0, %constant_5507_0), direction=LT, metadata={scheduling_name="compare.1658.0"}
  %xor.73.0 = s32[] xor(%constant_5508_0, %bitcast-convert.73.0), metadata={scheduling_name="xor.73.0"}
  %select.1326.0 = s32[] select(%compare.1658.0, %xor.73.0, %bitcast-convert.73.0), metadata={scheduling_name="select.1326.0"}
  %bitcast-convert.72.0 = s32[] bitcast-convert(%p.0.lhs.34), metadata={scheduling_name="bitcast-convert.72.0"}
  %compare.1657.0 = pred[] compare(%bitcast-convert.72.0, %constant_5507_0), direction=LT, metadata={scheduling_name="compare.1657.0"}
  %xor.72.0 = s32[] xor(%constant_5508_0, %bitcast-convert.72.0), metadata={scheduling_name="xor.72.0"}
  %select.1325.0 = s32[] select(%compare.1657.0, %xor.72.0, %bitcast-convert.72.0), metadata={scheduling_name="select.1325.0"}
  %compare.1659.0 = pred[] compare(%select.1325.0, %select.1326.0), direction=GT, metadata={scheduling_name="compare.1659.0"}
  %compare.1660.0 = pred[] compare(%select.1326.0, %select.1325.0), direction=GT, metadata={scheduling_name="compare.1660.0"}
  %compare.1661.0 = pred[] compare(%compare.1659.0, %compare.1660.0), direction=EQ, metadata={scheduling_name="compare.1661.0"}
  ROOT %select.1327.0 = pred[] select(%compare.1661.0, %compare.1662.0, %compare.1659.0), metadata={scheduling_name="select.1327.0"}
}

%compare-greater-than.6.clone.clone.clone.clone.clone.clone.clone.clone.clone.3 (p.0.lhs.36: f32[], p.0.rhs.36: f32[], p.1.lhs.36: s32[], p.1.rhs.36: s32[]) -> pred[] {
  %constant_5512_0 = s32[] constant(2147483647)
  %constant_5511_0 = s32[] constant(0)
  %p.1.rhs.36 = s32[] parameter(3), metadata={scheduling_name="p.1.rhs.36"}
  %p.1.lhs.36 = s32[] parameter(2), metadata={scheduling_name="p.1.lhs.36"}
  %p.0.rhs.36 = f32[] parameter(1), metadata={scheduling_name="p.0.rhs.36"}
  %p.0.lhs.36 = f32[] parameter(0), metadata={scheduling_name="p.0.lhs.36"}
  %compare.1678.0 = pred[] compare(%p.1.lhs.36, %p.1.rhs.36), direction=LT, metadata={scheduling_name="compare.1678.0"}
  %bitcast-convert.77.0 = s32[] bitcast-convert(%p.0.rhs.36), metadata={scheduling_name="bitcast-convert.77.0"}
  %compare.1674.0 = pred[] compare(%bitcast-convert.77.0, %constant_5511_0), direction=LT, metadata={scheduling_name="compare.1674.0"}
  %xor.77.0 = s32[] xor(%constant_5512_0, %bitcast-convert.77.0), metadata={scheduling_name="xor.77.0"}
  %select.1334.0 = s32[] select(%compare.1674.0, %xor.77.0, %bitcast-convert.77.0), metadata={scheduling_name="select.1334.0"}
  %bitcast-convert.76.0 = s32[] bitcast-convert(%p.0.lhs.36), metadata={scheduling_name="bitcast-convert.76.0"}
  %compare.1673.0 = pred[] compare(%bitcast-convert.76.0, %constant_5511_0), direction=LT, metadata={scheduling_name="compare.1673.0"}
  %xor.76.0 = s32[] xor(%constant_5512_0, %bitcast-convert.76.0), metadata={scheduling_name="xor.76.0"}
  %select.1333.0 = s32[] select(%compare.1673.0, %xor.76.0, %bitcast-convert.76.0), metadata={scheduling_name="select.1333.0"}
  %compare.1675.0 = pred[] compare(%select.1333.0, %select.1334.0), direction=GT, metadata={scheduling_name="compare.1675.0"}
  %compare.1676.0 = pred[] compare(%select.1334.0, %select.1333.0), direction=GT, metadata={scheduling_name="compare.1676.0"}
  %compare.1677.0 = pred[] compare(%compare.1675.0, %compare.1676.0), direction=EQ, metadata={scheduling_name="compare.1677.0"}
  ROOT %select.1335.0 = pred[] select(%compare.1677.0, %compare.1678.0, %compare.1675.0), metadata={scheduling_name="select.1335.0"}
}

%compare-value-and-index.9.clone.clone.2 (p.0.lhs.35: f32[], p.0.rhs.35: f32[], p.1.lhs.35: s32[], p.1.rhs.35: s32[], p.2.lhs.clone.6: s32[], p.2.rhs.clone.6: s32[]) -> pred[] {
  %constant_5510_0 = s32[] constant(2147483647)
  %constant_5509_0 = s32[] constant(0)
  %p.2.rhs.clone.6 = s32[] parameter(5), metadata={scheduling_name="p.2.rhs.clone.6"}
  %p.2.lhs.clone.6 = s32[] parameter(4), metadata={scheduling_name="p.2.lhs.clone.6"}
  %p.1.rhs.35 = s32[] parameter(3), metadata={scheduling_name="p.1.rhs.35"}
  %p.1.lhs.35 = s32[] parameter(2), metadata={scheduling_name="p.1.lhs.35"}
  %p.0.rhs.35 = f32[] parameter(1), metadata={scheduling_name="p.0.rhs.35"}
  %p.0.lhs.35 = f32[] parameter(0), metadata={scheduling_name="p.0.lhs.35"}
  %compare.1672.0 = pred[] compare(%p.2.lhs.clone.6, %p.2.rhs.clone.6), direction=LT, metadata={scheduling_name="compare.1672.0"}
  %compare.1669.0 = pred[] compare(%p.1.rhs.35, %p.1.lhs.35), direction=LT, metadata={scheduling_name="compare.1669.0"}
  %compare.1666.0 = pred[] compare(%p.1.lhs.35, %p.1.rhs.35), direction=LT, metadata={scheduling_name="compare.1666.0"}
  %bitcast-convert.75.0 = s32[] bitcast-convert(%p.0.rhs.35), metadata={scheduling_name="bitcast-convert.75.0"}
  %compare.1664.0 = pred[] compare(%bitcast-convert.75.0, %constant_5509_0), direction=LT, metadata={scheduling_name="compare.1664.0"}
  %xor.75.0 = s32[] xor(%constant_5510_0, %bitcast-convert.75.0), metadata={scheduling_name="xor.75.0"}
  %select.1329.0 = s32[] select(%compare.1664.0, %xor.75.0, %bitcast-convert.75.0), metadata={scheduling_name="select.1329.0"}
  %compare.1670.0 = pred[] compare(%p.0.rhs.35, %p.0.lhs.35), direction=GT, metadata={scheduling_name="compare.1670.0"}
  %compare.1667.0 = pred[] compare(%p.0.lhs.35, %p.0.rhs.35), direction=GT, metadata={scheduling_name="compare.1667.0"}
  %bitcast-convert.74.0 = s32[] bitcast-convert(%p.0.lhs.35), metadata={scheduling_name="bitcast-convert.74.0"}
  %compare.1663.0 = pred[] compare(%bitcast-convert.74.0, %constant_5509_0), direction=LT, metadata={scheduling_name="compare.1663.0"}
  %xor.74.0 = s32[] xor(%constant_5510_0, %bitcast-convert.74.0), metadata={scheduling_name="xor.74.0"}
  %select.1328.0 = s32[] select(%compare.1663.0, %xor.74.0, %bitcast-convert.74.0), metadata={scheduling_name="select.1328.0"}
  %compare.1665.0 = pred[] compare(%select.1328.0, %select.1329.0), direction=EQ, metadata={scheduling_name="compare.1665.0"}
  %select.1330.0 = pred[] select(%compare.1665.0, %compare.1666.0, %compare.1667.0), metadata={scheduling_name="select.1330.0"}
  %compare.1668.0 = pred[] compare(%select.1329.0, %select.1328.0), direction=EQ, metadata={scheduling_name="compare.1668.0"}
  %select.1331.0 = pred[] select(%compare.1668.0, %compare.1669.0, %compare.1670.0), metadata={scheduling_name="select.1331.0"}
  %compare.1671.0 = pred[] compare(%select.1330.0, %select.1331.0), direction=EQ, metadata={scheduling_name="compare.1671.0"}
  ROOT %select.1332.0 = pred[] select(%compare.1671.0, %compare.1672.0, %select.1330.0), metadata={scheduling_name="select.1332.0"}
}

%compare-value-and-index.9.clone.clone.3 (p.0.lhs.37: f32[], p.0.rhs.37: f32[], p.1.lhs.37: s32[], p.1.rhs.37: s32[], p.2.lhs.clone.7: s32[], p.2.rhs.clone.7: s32[]) -> pred[] {
  %constant_5514_0 = s32[] constant(2147483647)
  %constant_5513_0 = s32[] constant(0)
  %p.2.rhs.clone.7 = s32[] parameter(5), metadata={scheduling_name="p.2.rhs.clone.7"}
  %p.2.lhs.clone.7 = s32[] parameter(4), metadata={scheduling_name="p.2.lhs.clone.7"}
  %p.1.rhs.37 = s32[] parameter(3), metadata={scheduling_name="p.1.rhs.37"}
  %p.1.lhs.37 = s32[] parameter(2), metadata={scheduling_name="p.1.lhs.37"}
  %p.0.rhs.37 = f32[] parameter(1), metadata={scheduling_name="p.0.rhs.37"}
  %p.0.lhs.37 = f32[] parameter(0), metadata={scheduling_name="p.0.lhs.37"}
  %compare.1688.0 = pred[] compare(%p.2.lhs.clone.7, %p.2.rhs.clone.7), direction=LT, metadata={scheduling_name="compare.1688.0"}
  %compare.1685.0 = pred[] compare(%p.1.rhs.37, %p.1.lhs.37), direction=LT, metadata={scheduling_name="compare.1685.0"}
  %compare.1682.0 = pred[] compare(%p.1.lhs.37, %p.1.rhs.37), direction=LT, metadata={scheduling_name="compare.1682.0"}
  %bitcast-convert.79.0 = s32[] bitcast-convert(%p.0.rhs.37), metadata={scheduling_name="bitcast-convert.79.0"}
  %compare.1680.0 = pred[] compare(%bitcast-convert.79.0, %constant_5513_0), direction=LT, metadata={scheduling_name="compare.1680.0"}
  %xor.79.0 = s32[] xor(%constant_5514_0, %bitcast-convert.79.0), metadata={scheduling_name="xor.79.0"}
  %select.1337.0 = s32[] select(%compare.1680.0, %xor.79.0, %bitcast-convert.79.0), metadata={scheduling_name="select.1337.0"}
  %compare.1686.0 = pred[] compare(%p.0.rhs.37, %p.0.lhs.37), direction=GT, metadata={scheduling_name="compare.1686.0"}
  %compare.1683.0 = pred[] compare(%p.0.lhs.37, %p.0.rhs.37), direction=GT, metadata={scheduling_name="compare.1683.0"}
  %bitcast-convert.78.0 = s32[] bitcast-convert(%p.0.lhs.37), metadata={scheduling_name="bitcast-convert.78.0"}
  %compare.1679.0 = pred[] compare(%bitcast-convert.78.0, %constant_5513_0), direction=LT, metadata={scheduling_name="compare.1679.0"}
  %xor.78.0 = s32[] xor(%constant_5514_0, %bitcast-convert.78.0), metadata={scheduling_name="xor.78.0"}
  %select.1336.0 = s32[] select(%compare.1679.0, %xor.78.0, %bitcast-convert.78.0), metadata={scheduling_name="select.1336.0"}
  %compare.1681.0 = pred[] compare(%select.1336.0, %select.1337.0), direction=EQ, metadata={scheduling_name="compare.1681.0"}
  %select.1338.0 = pred[] select(%compare.1681.0, %compare.1682.0, %compare.1683.0), metadata={scheduling_name="select.1338.0"}
  %compare.1684.0 = pred[] compare(%select.1337.0, %select.1336.0), direction=EQ, metadata={scheduling_name="compare.1684.0"}
  %select.1339.0 = pred[] select(%compare.1684.0, %compare.1685.0, %compare.1686.0), metadata={scheduling_name="select.1339.0"}
  %compare.1687.0 = pred[] compare(%select.1338.0, %select.1339.0), direction=EQ, metadata={scheduling_name="compare.1687.0"}
  ROOT %select.1340.0 = pred[] select(%compare.1687.0, %compare.1688.0, %select.1338.0), metadata={scheduling_name="select.1340.0"}
}

%fused_dynamic_update_slice (param_0.2416: bf16[9,1,4,8192,6144], param_1.2626: s32[], param_2.2726: bf16[4,8192,6144]) -> bf16[9,1,4,8192,6144] {
  %param_0.2416 = bf16[9,1,4,8192,6144]{4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.2416"}
  %param_2.2726 = bf16[4,8192,6144]{2,1,0} parameter(2), metadata={scheduling_name="param_2.2726"}
  %bitcast.26147.1 = bf16[1,1,4,8192,6144]{4,3,2,1,0} bitcast(%param_2.2726), metadata={scheduling_name="bitcast.26147.1"}
  %param_1.2626 = s32[] parameter(1), metadata={scheduling_name="param_1.2626"}
  %constant_5429_31 = s32[] constant(0)
  ROOT %dynamic-update-slice.425.1 = bf16[9,1,4,8192,6144]{4,3,2,1,0} dynamic-update-slice(%param_0.2416, %bitcast.26147.1, %param_1.2626, %constant_5429_31, %constant_5429_31, /*index=5*/%constant_5429_31, %constant_5429_31), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/dynamic_update_slice" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=783 scheduling_name="dynamic-update-slice.425.1"}
}

%fused_dynamic_update_slice.1 (param_0.2417: bf16[9,1,4,8192,48,128], param_1.2628: s32[], param_2.2702: bf16[1,4,8192,48,128]) -> bf16[9,1,4,8192,48,128] {
  %param_0.2417 = bf16[9,1,4,8192,48,128]{5,4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.2417"}
  %param_2.2702 = bf16[1,4,8192,48,128]{4,3,2,1,0} parameter(2), metadata={scheduling_name="param_2.2702"}
  %bitcast.26184.1 = bf16[1,1,4,8192,48,128]{5,4,3,2,1,0} bitcast(%param_2.2702), metadata={scheduling_name="bitcast.26184.1"}
  %param_1.2628 = s32[] parameter(1), metadata={scheduling_name="param_1.2628"}
  %constant_5429_2 = s32[] constant(0)
  ROOT %dynamic-update-slice.428.1 = bf16[9,1,4,8192,48,128]{5,4,3,2,1,0} dynamic-update-slice(%param_0.2417, %bitcast.26184.1, %param_1.2628, %constant_5429_2, %constant_5429_2, /*index=5*/%constant_5429_2, %constant_5429_2, %constant_5429_2), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/dynamic_update_slice" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=783 scheduling_name="dynamic-update-slice.428.1"}
}

%fused_dynamic_update_slice.2 (param_0.2418: u32[9,2,4], param_1.2630: s32[], param_2.2711: u32[2,4]) -> u32[9,2,4] {
  %param_0.2418 = u32[9,2,4]{2,1,0} parameter(0), metadata={scheduling_name="param_0.2418"}
  %param_2.2711 = u32[2,4]{1,0} parameter(2), metadata={scheduling_name="param_2.2711"}
  %bitcast.26173.1 = u32[1,2,4]{2,1,0} bitcast(%param_2.2711), metadata={scheduling_name="bitcast.26173.1"}
  %param_1.2630 = s32[] parameter(1), metadata={scheduling_name="param_1.2630"}
  %constant_5429_16 = s32[] constant(0)
  ROOT %dynamic-update-slice.427.1 = u32[9,2,4]{2,1,0} dynamic-update-slice(%param_0.2418, %bitcast.26173.1, %param_1.2630, %constant_5429_16, %constant_5429_16), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/dynamic_update_slice" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=783 scheduling_name="dynamic-update-slice.427.1"}
}

%fused_dynamic_update_slice.3 (param_0.2420: s32[], param_1.3491: f32[1,4,48,8192,1], param_2.2715: f32[9,1,4,48,8192,1]) -> f32[9,1,1,4,48,8192] {
  %param_2.2715 = f32[9,1,4,48,8192,1]{4,3,2,5,1,0} parameter(2), metadata={scheduling_name="param_2.2715"}
  %bitcast.26156.1 = f32[9,1,1,4,48,8192]{5,4,3,2,1,0} bitcast(%param_2.2715), metadata={scheduling_name="bitcast.26156.1"}
  %param_1.3491 = f32[1,4,48,8192,1]{4,3,2,1,0} parameter(1), metadata={scheduling_name="param_1.3491"}
  %bitcast.26160.1 = f32[1,1,1,4,48,8192]{5,4,3,2,1,0} bitcast(%param_1.3491), metadata={scheduling_name="bitcast.26160.1"}
  %param_0.2420 = s32[] parameter(0), metadata={scheduling_name="param_0.2420"}
  %constant_5429_20 = s32[] constant(0)
  ROOT %dynamic-update-slice.426.1 = f32[9,1,1,4,48,8192]{5,4,3,2,1,0} dynamic-update-slice(%bitcast.26156.1, %bitcast.26160.1, %param_0.2420, %constant_5429_20, %constant_5429_20, /*index=5*/%constant_5429_20, %constant_5429_20, %constant_5429_20), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/dynamic_update_slice" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=783 scheduling_name="dynamic-update-slice.426.1"}
}

%fused_dynamic_update_slice.4 (param_0.2421: bf16[9,1,4,8192,48,128], param_1.2635: s32[], param_2.2725: bf16[1,4,8192,48,128]) -> bf16[9,1,4,8192,48,128] {
  %param_0.2421 = bf16[9,1,4,8192,48,128]{5,4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.2421"}
  %param_2.2725 = bf16[1,4,8192,48,128]{4,3,2,1,0} parameter(2), metadata={scheduling_name="param_2.2725"}
  %bitcast.26136.1 = bf16[1,1,4,8192,48,128]{5,4,3,2,1,0} bitcast(%param_2.2725), metadata={scheduling_name="bitcast.26136.1"}
  %param_1.2635 = s32[] parameter(1), metadata={scheduling_name="param_1.2635"}
  %constant_5429_30 = s32[] constant(0)
  ROOT %dynamic-update-slice.424.1 = bf16[9,1,4,8192,48,128]{5,4,3,2,1,0} dynamic-update-slice(%param_0.2421, %bitcast.26136.1, %param_1.2635, %constant_5429_30, %constant_5429_30, /*index=5*/%constant_5429_30, %constant_5429_30, %constant_5429_30), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/dynamic_update_slice" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=783 scheduling_name="dynamic-update-slice.424.1"}
}

%fused_dynamic_update_slice.5 (param_0.2422: u32[9,2,4], param_1.2637: s32[], param_2.2722: u32[2,4]) -> u32[9,2,4] {
  %param_0.2422 = u32[9,2,4]{2,1,0} parameter(0), metadata={scheduling_name="param_0.2422"}
  %param_2.2722 = u32[2,4]{1,0} parameter(2), metadata={scheduling_name="param_2.2722"}
  %bitcast.26125.1 = u32[1,2,4]{2,1,0} bitcast(%param_2.2722), metadata={scheduling_name="bitcast.26125.1"}
  %param_1.2637 = s32[] parameter(1), metadata={scheduling_name="param_1.2637"}
  %constant_5429_27 = s32[] constant(0)
  ROOT %dynamic-update-slice.423.1 = u32[9,2,4]{2,1,0} dynamic-update-slice(%param_0.2422, %bitcast.26125.1, %param_1.2637, %constant_5429_27, %constant_5429_27), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/dynamic_update_slice" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=783 scheduling_name="dynamic-update-slice.423.1"}
}

%fused_dynamic_update_slice.6 (param_0.2424: s32[], param_1.3499: f32[1,4,48,8192,1], param_2.2724: f32[9,1,4,48,8192,1]) -> f32[9,1,1,4,48,8192] {
  %param_2.2724 = f32[9,1,4,48,8192,1]{4,3,2,5,1,0} parameter(2), metadata={scheduling_name="param_2.2724"}
  %bitcast.26108.1 = f32[9,1,1,4,48,8192]{5,4,3,2,1,0} bitcast(%param_2.2724), metadata={scheduling_name="bitcast.26108.1"}
  %param_1.3499 = f32[1,4,48,8192,1]{4,3,2,1,0} parameter(1), metadata={scheduling_name="param_1.3499"}
  %bitcast.26112.1 = f32[1,1,1,4,48,8192]{5,4,3,2,1,0} bitcast(%param_1.3499), metadata={scheduling_name="bitcast.26112.1"}
  %param_0.2424 = s32[] parameter(0), metadata={scheduling_name="param_0.2424"}
  %constant_5429_29 = s32[] constant(0)
  ROOT %dynamic-update-slice.422.1 = f32[9,1,1,4,48,8192]{5,4,3,2,1,0} dynamic-update-slice(%bitcast.26108.1, %bitcast.26112.1, %param_0.2424, %constant_5429_29, %constant_5429_29, /*index=5*/%constant_5429_29, %constant_5429_29, %constant_5429_29), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/dynamic_update_slice" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=783 scheduling_name="dynamic-update-slice.422.1"}
}

%fused_dynamic_update_slice.7 (param_0.2425: bf16[9,1,4,8192,6144], param_1.2642: s32[], param_2.2727: bf16[1,4,8192,6144]) -> bf16[9,1,4,8192,6144] {
  %param_0.2425 = bf16[9,1,4,8192,6144]{4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.2425"}
  %param_2.2727 = bf16[1,4,8192,6144]{3,2,1,0} parameter(2), metadata={scheduling_name="param_2.2727"}
  %bitcast.26099.1 = bf16[1,1,4,8192,6144]{4,3,2,1,0} bitcast(%param_2.2727), metadata={scheduling_name="bitcast.26099.1"}
  %param_1.2642 = s32[] parameter(1), metadata={scheduling_name="param_1.2642"}
  %constant_5429_32 = s32[] constant(0)
  ROOT %dynamic-update-slice.421.1 = bf16[9,1,4,8192,6144]{4,3,2,1,0} dynamic-update-slice(%param_0.2425, %bitcast.26099.1, %param_1.2642, %constant_5429_32, %constant_5429_32, /*index=5*/%constant_5429_32, %constant_5429_32), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/dynamic_update_slice" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=783 scheduling_name="dynamic-update-slice.421.1"}
}

%fused_dynamic_update_slice.8 (param_0.2426: bf16[1,2,4,8192,6144], param_1.3497: pred[1,4,8192,6144], param_2.2721: bf16[1,4,8192,6144], param_3.2211: bf16[4,8192,6144], param_4.1847: s32[]) -> bf16[1,2,4,8192,6144] {
  %param_0.2426 = bf16[1,2,4,8192,6144]{4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.2426"}
  %param_1.3497 = pred[1,4,8192,6144]{3,2,1,0} parameter(1), metadata={scheduling_name="param_1.3497"}
  %param_3.2211 = bf16[4,8192,6144]{2,1,0} parameter(3), metadata={scheduling_name="param_3.2211"}
  %bitcast.26080.3 = bf16[1,4,8192,6144]{3,2,1,0} bitcast(%param_3.2211), metadata={scheduling_name="bitcast.26080.3"}
  %param_2.2721 = bf16[1,4,8192,6144]{3,2,1,0} parameter(2), metadata={scheduling_name="param_2.2721"}
  %select.1365.3 = bf16[1,4,8192,6144]{3,2,1,0} select(%param_1.3497, %bitcast.26080.3, %param_2.2721), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_new_loop_state/jit(_where)/select_n" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=348 scheduling_name="select.1365.3"}
  %bitcast.26088.1 = bf16[1,1,4,8192,6144]{4,3,2,1,0} bitcast(%select.1365.3), metadata={scheduling_name="bitcast.26088.1"}
  %constant_5429_26 = s32[] constant(0)
  %param_4.1847 = s32[] parameter(4), metadata={scheduling_name="param_4.1847"}
  %compare.1694.1 = pred[] compare(%param_4.1847, %constant_5429_26), direction=LT, metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_iteration_inputs/jit(remainder)/rem" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=168 scheduling_name="compare.1694.1"}
  %negate.227.1 = s32[] negate(%param_4.1847), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_iteration_inputs/jit(remainder)/rem" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=168 scheduling_name="negate.227.1"}
  %select.1345.3 = s32[] select(%compare.1694.1, %negate.227.1, %param_4.1847), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_iteration_inputs/jit(remainder)/rem" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=168 scheduling_name="select.1345.3"}
  %constant_5427_3 = s32[] constant(1)
  %and.317.1 = s32[] and(%select.1345.3, %constant_5427_3), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_iteration_inputs/jit(remainder)/rem" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=168 scheduling_name="and.317.1"}
  %negate.228.1 = s32[] negate(%and.317.1), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_iteration_inputs/jit(remainder)/rem" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=168 scheduling_name="negate.228.1"}
  %select.1346.3 = s32[] select(%compare.1694.1, %negate.228.1, %and.317.1), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_iteration_inputs/jit(remainder)/rem" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=168 scheduling_name="select.1346.3"}
  %compare.1695.1 = pred[] compare(%select.1346.3, %constant_5429_26), direction=LT, metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_iteration_inputs/jit(remainder)/lt" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=168 scheduling_name="compare.1695.1"}
  %compare.1696.1 = pred[] compare(%select.1346.3, %constant_5429_26), direction=NE, metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_iteration_inputs/jit(remainder)/ne" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=168 scheduling_name="compare.1696.1"}
  %and.318.3 = pred[] and(%compare.1695.1, %compare.1696.1), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_iteration_inputs/jit(remainder)/and" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=168 scheduling_name="and.318.3"}
  %constant_5433_2 = s32[] constant(2), metadata={op_name="jit(train_step)/jit(main)/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_iteration_inputs/jit(remainder)/jit(_where)/select_n" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=168}
  %add.3074.3 = s32[] add(%select.1346.3, %constant_5433_2), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_iteration_inputs/jit(remainder)/add" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=168 scheduling_name="add.3074.3"}
  %select.1347.2 = s32[] select(%and.318.3, %add.3074.3, %select.1346.3), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_iteration_inputs/jit(remainder)/select_n" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=168 scheduling_name="select.1347.2"}
  %compare.1697.2 = pred[] compare(%select.1347.2, %constant_5429_26), direction=LT, metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_iteration_inputs/lt" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=169 scheduling_name="compare.1697.2"}
  %add.3075.2 = s32[] add(%select.1347.2, %constant_5433_2), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_iteration_inputs/add" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=169 scheduling_name="add.3075.2"}
  %select.1348.1 = s32[] select(%compare.1697.2, %add.3075.2, %select.1347.2), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_iteration_inputs/select_n" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=169 scheduling_name="select.1348.1"}
  ROOT %dynamic-update-slice.420.1 = bf16[1,2,4,8192,6144]{4,3,2,1,0} dynamic-update-slice(%param_0.2426, %bitcast.26088.1, %constant_5429_26, %select.1348.1, %constant_5429_26, /*index=5*/%constant_5429_26, %constant_5429_26), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/pipeline_module.get_new_loop_state/dynamic_update_slice" source_file="/workspace/maxtext/MaxText/layers/pipeline.py" source_line=352 scheduling_name="dynamic-update-slice.420.1"}
}

%fused_transpose (param_0.2429: bf16[1,1,1,8,4,2048,6144]) -> bf16[4,8,12582912] {
  %param_0.2429 = bf16[1,1,1,8,4,2048,6144]{6,5,4,2,1,0,3} parameter(0), metadata={scheduling_name="param_0.2429"}
  %bitcast.26062.1 = bf16[8,4,12582912]{2,1,0} bitcast(%param_0.2429), metadata={scheduling_name="bitcast.26062.1"}
  ROOT %transpose.764.1 = bf16[4,8,12582912]{2,1,0} transpose(%bitcast.26062.1), dimensions={1,0,2}, metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_1/MoeBlock_0/combine/EBCM,BSEC -> BSM/dot_general" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1460 scheduling_name="transpose.764.1"}
}

%fused_transpose.1 (param_0.2435: bf16[4,16384,6144]) -> bf16[8,4,12582912] {
  %param_0.2435 = bf16[4,16384,6144]{2,1,0} parameter(0), metadata={scheduling_name="param_0.2435"}
  %bitcast.26004.1 = bf16[4,8,12582912]{2,1,0} bitcast(%param_0.2435), metadata={scheduling_name="bitcast.26004.1"}
  ROOT %transpose.763.1 = bf16[8,4,12582912]{2,1,0} transpose(%bitcast.26004.1), dimensions={1,0,2}, metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_1/MoeBlock_0/dispatch/BSM,BSEC -> EBCM/dot_general" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1388 scheduling_name="transpose.763.1"}
}

%fused_convert_transpose (param_0.3014: s32[1,1,1,1,2049], param_1.3111: s32[1,4,8,8192], param_2.2323: bf16[1,4,8,8192]) -> (bf16[4,16384,8192], bf16[4,8192,16384]) {
  %param_2.2323 = bf16[1,4,8,8192]{3,2,1,0} parameter(2), metadata={scheduling_name="param_2.2323"}
  %bitcast.25951.8 = bf16[4,8,8192]{2,1,0} bitcast(%param_2.2323), metadata={scheduling_name="bitcast.25951.8"}
  %convert.5011.5 = f32[4,8,8192]{2,1,0} convert(%bitcast.25951.8), metadata={scheduling_name="convert.5011.5"}
  %broadcast.6065.11 = f32[1,4,8,2049,8192]{4,3,2,1,0} broadcast(%convert.5011.5), dimensions={1,2,4}, metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_1/MoeBlock_0/mul" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1170 scheduling_name="broadcast.6065.11"}
  %param_1.3111 = s32[1,4,8,8192]{3,2,1,0} parameter(1), metadata={scheduling_name="param_1.3111"}
  %bitcast.25973.9 = s32[4,8,8192]{2,1,0} bitcast(%param_1.3111), metadata={scheduling_name="bitcast.25973.9"}
  %broadcast.5774.9 = s32[1,4,8,2049,8192]{4,3,2,1,0} broadcast(%bitcast.25973.9), dimensions={1,2,4}, metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_0/MoeBlock_0/jit(_one_hot)/eq" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1161 scheduling_name="broadcast.5774.9"}
  %param_0.3014 = s32[1,1,1,1,2049]{4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.3014"}
  %bitcast.25431.15 = s32[2049]{0} bitcast(%param_0.3014), metadata={scheduling_name="bitcast.25431.15"}
  %broadcast.5750.15 = s32[1,4,8,2049,8192]{4,3,2,1,0} broadcast(%bitcast.25431.15), dimensions={3}, metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_0/MoeBlock_0/jit(_one_hot)/eq" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1161 scheduling_name="broadcast.5750.15"}
  %compare.1717.7 = pred[1,4,8,2049,8192]{4,3,2,1,0} compare(%broadcast.5774.9, %broadcast.5750.15), direction=EQ, metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_0/MoeBlock_0/jit(_one_hot)/eq" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1161 scheduling_name="compare.1717.7"}
  %convert.4304.9 = s32[1,4,8,2049,8192]{4,3,2,1,0} convert(%compare.1717.7), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_0/MoeBlock_0/jit(_one_hot)/convert_element_type" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1161 scheduling_name="convert.4304.9"}
  %convert.4306.9 = f32[1,4,8,2049,8192]{4,3,2,1,0} convert(%convert.4304.9), metadata={scheduling_name="convert.4306.9"}
  %multiply.2736.11 = f32[1,4,8,2049,8192]{4,3,2,1,0} multiply(%broadcast.6065.11, %convert.4306.9), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_1/MoeBlock_0/mul" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1170 scheduling_name="multiply.2736.11"}
  %convert.4307.9 = bf16[1,4,8,2049,8192]{4,3,2,1,0} convert(%multiply.2736.11), metadata={scheduling_name="convert.4307.9"}
  %slice.2441.7 = bf16[1,4,8,2048,8192]{4,3,2,1,0} slice(%convert.4307.9), slice={[0:1], [0:4], [0:8], [1:2049], [0:8192]}, metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_1/MoeBlock_0/slice" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1171 scheduling_name="slice.2441.7"}
  %convert.4308.3 = f32[1,4,8,2048,8192]{4,3,2,1,0} convert(%slice.2441.7), metadata={scheduling_name="convert.4308.3"}
  %constant_5432_5 = bf16[] constant(0)
  %convert.5007.1 = f32[] convert(%constant_5432_5), metadata={scheduling_name="convert.5007.1"}
  %broadcast.6062.4 = f32[1,4,8,2048,8192]{4,3,2,1,0} broadcast(%convert.5007.1), dimensions={}, metadata={scheduling_name="broadcast.6062.4"}
  %compare.1718.3 = pred[1,4,8,2048,8192]{4,3,2,1,0} compare(%convert.4308.3, %broadcast.6062.4), direction=NE, metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_1/MoeBlock_0/convert_element_type" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1172 scheduling_name="compare.1718.3"}
  %bitcast.25995.1 = pred[4,16384,8192]{2,1,0} bitcast(%compare.1718.3), metadata={scheduling_name="bitcast.25995.1"}
  %convert.4310.1 = bf16[4,16384,8192]{2,1,0} convert(%bitcast.25995.1), metadata={scheduling_name="convert.4310.1"}
  %bitcast.25984.1.clone.1 = bf16[4,16384,8192]{2,1,0} bitcast(%slice.2441.7), metadata={scheduling_name="bitcast.25984.1.clone.1"}
  %transpose.762.1.clone.1 = bf16[4,8192,16384]{2,1,0} transpose(%bitcast.25984.1.clone.1), dimensions={0,2,1}, metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_1/MoeBlock_0/slice" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1171 scheduling_name="transpose.762.1.clone.1"}
  ROOT %tuple.543 = (bf16[4,16384,8192]{2,1,0}, bf16[4,8192,16384]{2,1,0}) tuple(%convert.4310.1, %transpose.762.1.clone.1), metadata={scheduling_name="tuple.543"}
}

%fused_multiply_transpose (param_0.2454: s32[4,8,8192], param_1.2653: s32[4,8,8192], param_2.4739: bf16[1,4,8192,8]) -> (s32[1,4,8,8192], bf16[1,4,8,8192]) {
  %param_0.2454 = s32[4,8,8192]{2,1,0} parameter(0), metadata={scheduling_name="param_0.2454"}
  %bitcast.25968.1 = s32[1,4,8,8192]{3,2,1,0} bitcast(%param_0.2454), metadata={scheduling_name="bitcast.25968.1"}
  %param_1.2653 = s32[4,8,8192]{2,1,0} parameter(1), metadata={scheduling_name="param_1.2653"}
  %bitcast.25946.2 = s32[1,4,8,8192]{3,2,1,0} bitcast(%param_1.2653), metadata={scheduling_name="bitcast.25946.2"}
  %multiply.2735.1 = s32[1,4,8,8192]{3,2,1,0} multiply(%bitcast.25968.1, %bitcast.25946.2), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_1/MoeBlock_0/mul" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1160 scheduling_name="multiply.2735.1"}
  %param_2.4739 = bf16[1,4,8192,8]{3,2,1,0} parameter(2), metadata={scheduling_name="param_2.4739"}
  %bitcast.25865.3.clone.1 = bf16[4,8192,8]{2,1,0} bitcast(%param_2.4739), metadata={scheduling_name="bitcast.25865.3.clone.1"}
  %transpose.761.3.clone.1 = bf16[4,8,8192]{2,1,0} transpose(%bitcast.25865.3.clone.1), dimensions={0,2,1}, metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_1/MoeBlock_0/scatter-add" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1000 scheduling_name="transpose.761.3.clone.1"}
  %bitcast.25868.5.clone.1 = bf16[1,4,8,8192]{3,2,1,0} bitcast(%transpose.761.3.clone.1), metadata={scheduling_name="bitcast.25868.5.clone.1"}
  %convert.4298.5.clone.1 = f32[1,4,8,8192]{3,2,1,0} convert(%bitcast.25868.5.clone.1), metadata={scheduling_name="convert.4298.5.clone.1"}
  %convert.4300.3.clone.1 = f32[1,4,8,8192]{3,2,1,0} convert(%bitcast.25946.2), metadata={scheduling_name="convert.4300.3.clone.1"}
  %multiply.2733.3.clone.1 = f32[1,4,8,8192]{3,2,1,0} multiply(%convert.4298.5.clone.1, %convert.4300.3.clone.1), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_1/MoeBlock_0/mul" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1152 scheduling_name="multiply.2733.3.clone.1"}
  %convert.4301.1.clone.1 = bf16[1,4,8,8192]{3,2,1,0} convert(%multiply.2733.3.clone.1), metadata={scheduling_name="convert.4301.1.clone.1"}
  ROOT %tuple.544 = (s32[1,4,8,8192]{3,2,1,0}, bf16[1,4,8,8192]{3,2,1,0}) tuple(%multiply.2735.1, %convert.4301.1.clone.1), metadata={scheduling_name="tuple.544"}
}

%region_7.620 (Arg_0.621: s32[], Arg_1.622: s32[]) -> s32[] {
  %Arg_1.622 = s32[] parameter(1), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_0/MoeBlock_0/jit(cumsum)/reduce_window_sum" scheduling_name="Arg_1.622"}
  %Arg_0.621 = s32[] parameter(0), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_0/MoeBlock_0/jit(cumsum)/reduce_window_sum" scheduling_name="Arg_0.621"}
  ROOT %add.2837.0 = s32[] add(%Arg_0.621, %Arg_1.622), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_0/MoeBlock_0/jit(cumsum)/reduce_window_sum" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1140 scheduling_name="add.2837.0"}
}

%fused_reduce (param_0.3340: pred[1,4,8,8192,2], param_1.3516: s32[1,4,8,64,16], param_2.2745: s32[1,4,8,4,16]) -> (s32[4,8,8192], s32[4,8,8192]) {
  %param_0.3340 = pred[1,4,8,8192,2]{4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.3340"}
  %convert.4299.17 = s32[1,4,8,8192,2]{4,3,2,1,0} convert(%param_0.3340), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_0/MoeBlock_0/jit(_one_hot)/convert_element_type" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1179 scheduling_name="convert.4299.17"}
  %bitcast.25880.11 = s32[1,4,8,1024,16]{4,3,2,1,0} bitcast(%convert.4299.17), metadata={scheduling_name="bitcast.25880.11"}
  %constant_5429_24 = s32[] constant(0)
  %reduce-window.172.11 = s32[1,4,8,1024,16]{4,3,2,1,0} reduce-window(%bitcast.25880.11, %constant_5429_24), window={size=1x1x1x1x16 pad=0_0x0_0x0_0x0_0x15_0}, to_apply=%region_7.620, metadata={scheduling_name="reduce-window.172.11"}
  %param_1.3516 = s32[1,4,8,64,16]{4,3,2,1,0} parameter(1), metadata={scheduling_name="param_1.3516"}
  %param_2.2745 = s32[1,4,8,4,16]{4,3,2,1,0} parameter(2), metadata={scheduling_name="param_2.2745"}
  %slice.2437.7 = s32[1,4,8,4,1]{4,3,2,1,0} slice(%param_2.2745), slice={[0:1], [0:4], [0:8], [0:4], [15:16]}, metadata={scheduling_name="slice.2437.7"}
  %bitcast.25904.9 = s32[1,4,8,4]{3,2,1,0} bitcast(%slice.2437.7), metadata={scheduling_name="bitcast.25904.9"}
  %reduce-window.175.9 = s32[1,4,8,5]{3,2,1,0} reduce-window(%bitcast.25904.9, %constant_5429_24), window={size=1x1x1x4 pad=0_0x0_0x0_0x4_0}, to_apply=%region_7.620, metadata={scheduling_name="reduce-window.175.9"}
  %slice.2438.7 = s32[1,4,8,4]{3,2,1,0} slice(%reduce-window.175.9), slice={[0:1], [0:4], [0:8], [0:4]}, metadata={scheduling_name="slice.2438.7"}
  %bitcast.25910.9 = s32[4,8,4]{2,1,0} bitcast(%slice.2438.7), metadata={scheduling_name="bitcast.25910.9"}
  %broadcast.5768.9 = s32[1,4,8,4,16]{4,3,2,1,0} broadcast(%bitcast.25910.9), dimensions={1,2,3}, metadata={scheduling_name="broadcast.5768.9"}
  %add.3096.7 = s32[1,4,8,4,16]{4,3,2,1,0} add(%param_2.2745, %broadcast.5768.9), metadata={op_name="jit(train_step)/jit(main)/jvp(Transformer)/decoder/pipeline_module/while/body/pipeline_module.run_iteration_scannable/pipeline_module.run_one_iteration/vmap(layers.func_to_vmap)/layers/layers_0/MoeBlock_0/jit(cumsum)/reduce_window_sum" source_file="/workspace/maxtext/MaxText/layers/moe.py" source_line=1140 scheduling_name="add.3096.7"}
  %bitcast.25914.7 = s32[1,4,8,64]{3,2,1,0} bitcast(%add.3096.7), metadata={scheduling_name="bitcast.25914.7"}
  %pad.362.7 = s32[1,4,8,65]{3,2,1,0} pad(%bitcast.25914.7, %constant_5429_24), padding=0_0x0_0x0_0x1_0, metadata={scheduling_name="pad.362.7"}
  %slice.2439.5 = s32[1,4,8,64]{3,2,1,0} slice(%pad.362.7), slice={[0:1], [0:4], [0:8], [0:64]}, metadata={scheduling_name="slice.2439.5"}
  %bitcast.25918.9 = s32[4,8,64]{2,1,0} bitcast(%slice.2439.5), metadata={scheduling_name="bitcast.25918.9"}
  %broadcast.5769.9 = s32[1,4,8,64,16]{4,3,2,1,0} broadcast(%bitcast.25918.9), dimensions={1,2,3}, metadata={scheduling_name="broadcast.5769.9"}
